app/views/subjects/index.html.erb


	  <div><%= pluralize(@subjects.size, 'subject') %> found</div>
---
SELECT COUNT(*) FROM `subjects`
SELECT `subjects`.* FROM `subjects` ORDER BY subjects.position ASC