app/controllers/locations_controller.rb

SELECT `locations`.* FROM `locations`
---
  def index
    @locations = Location.all

INSERT INTO `locations` (`address`, `created_at`, `gmaps`, `latitude`, `longitude`, `name`, `updated_at`) VALUES ('fsdf', '2014-03-07 01:28:10', 1, 30.3262022, -87.4101941, 'fdsf', '2014-03-07 01:28:10')
---
  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save

UPDATE `locations` SET `longitude` = 49.0, `latitude` = 123.0, `updated_at` = '2014-03-07 01:26:23' WHERE `locations`.`id` = 1
---
  def update
    respond_to do |format|
      if @location.update(location_params)

DELETE FROM `locations` WHERE `locations`.`id` = 3
---
  def destroy
    @location.destroy

SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = 3 LIMIT 1
---
    def set_location
      @location = Location.find(params[:id])