app/controllers/pages_controller.rb

  def new
    @page = Page.new({:name => "Default"})
     @subjects = Subject.order('position ASC')
    @page_count = Page.count + 1
---
SELECT `subjects`.* FROM `subjects` ORDER BY position ASC
SELECT COUNT(*) FROM `pages`

  def edit
    @page = Page.find(params[:id])
    @subjects = Subject.order('position ASC')
    @page_count = Page.count
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1
SELECT `subjects`.* FROM `subjects` ORDER BY position ASC
SELECT COUNT(*) FROM `pages`

  def create
    @page = Page.new(page_params)
    if @page.save
---
INSERT INTO `pages` (`created_at`, `name`, `permalink`, `position`, `subject_id`, `updated_at`) VALUES ('2014-03-05 07:22:38', 'Test Page', 0, 3, 2, '2014-03-05 07:22:38')

  def update
    @page = Page.find(params[:id])
    if @page.update_attributes(page_params)
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1
UPDATE `pages` SET `name` = 'John\'s Page', `updated_at` = '2014-03-05 07:56:02' WHERE `pages`.`id` = 4

  def destroy
    page = Page.find(params[:id]).destroy
---
DELETE FROM `pages` WHERE `pages`.`id` = 2
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1