app/controllers/subjects_controller.rb

SELECT COUNT(*) FROM `subjects`
---
  def new
    @subject = Subject.new({:name => "Default"})
    @subject_count = Subject.count

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 4 LIMIT 1
SELECT COUNT(*) FROM `subjects`
---
  def edit
    @subject = Subject.find(params[:id])
    @subject_count = Subject.count + 1

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 4 LIMIT 1
UPDATE `subjects` SET `visible` = 1, `updated_at` = '2014-03-05 08:33:40' WHERE `subjects`.`id` = 4
---
  def update
    #find existing object
    @subject = Subject.find(params[:id])
    if @subject.update_attributes(subject_params)

DELETE FROM `subjects` WHERE `subjects`.`id` = 1
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
---
  def destroy
     subject = Subject.find(params[:id]).destroy